app/controllers/geolocations_controller.rb

INSERT INTO `geolocations` (`ip`, `continent_code`, `continent_name`, `country_code`, `country_name`, `region_code`, `region_name`, `city`, `zip`, `latitude`, `longitude`, `msa`, `dma`, `radius`, `created_at`, `updated_at`) VALUES ('134.201.250.155', 'NA', 'North America', 'US', 'United States', 'CA', 'California', 'Los Angeles', '90012', '34.0655517578125', '-118.24053955078125', '31100', '803', NULL, '2024-08-12 01:04:52.407166', '2024-08-12 01:04:52.407166')
---
  def create
    ip_address = params["ip_address"]
    if ip_address.nil?
	    ip=Socket.ip_address_list.detect{|intf| intf.ipv4_private?}
	    ip_address = ip.ip_address
	  end

    if ip_address.nil?
      render422_json(
        json_ext: {
          error_message: "ip address is empty."
        }
      )
      return
    end

    if !IPAddress.valid?(ip_address)
      render422_json(
        json_ext: {
          error_message: "The ip address is invalid."
        }
      )
      return
    end

    service_provider_name = SERVER_CONFIG["geo_service_providers"]["default"]

    service_provider_config = SERVER_CONFIG["geo_service_providers"][service_provider_name]
    service_provider = GeolocationServiceProvider.create(service_provider_config)

SELECT `geolocations`.* FROM `geolocations` WHERE `geolocations`.`ip` = '134.201.250.155' LIMIT 1
SELECT `geolocations`.* FROM `geolocations` WHERE `geolocations`.`ip` = '192.168.1.66' LIMIT 1
SELECT 1 AS one FROM `geolocations` WHERE `geolocations`.`ip` = '134.201.250.155' LIMIT 1
---
      return
    end

    @geolocation = Geolocation.find_by(ip: ip_address)

    if @geolocation.blank?

INSERT INTO `geolocations` (`ip`, `ip_type`, `continent_code`, `continent_name`, `country_code`, `country_name`, `region_code`, `region_name`, `city`, `zip`, `latitude`, `longitude`, `msa`, `dma`, `radius`, `created_at`, `updated_at`) VALUES ('22.33.11.22', 'ipv4', 'NA', 'North America', 'US', 'United States', 'FL', 'Florida', 'Boynton Beach', '33437', '26.509750366210938', '-80.1480712890625', '33100', '548', NULL, '2024-08-12 23:21:12.127652', '2024-08-12 23:21:12.127652')
UPDATE `geolocations` SET `geolocations`.`ip_type` = 'ipv4', `geolocations`.`updated_at` = '2024-08-12 23:20:55.671765' WHERE `geolocations`.`id` = 2
---
    	@geolocation.assign_attributes(geolocation_params)
    end

    if @geolocation.save

SELECT `geolocations`.* FROM `geolocations` WHERE `geolocations`.`ip` = '122.133.111.22' LIMIT 1
---
  def show
    ip_address = params["ip_address"]
    if !IPAddress.valid?(ip_address)
      render422_json(
        json_ext: {
          error_message: "The ip address is invalid."
        }
      )
      return
    end

    @geolocation = Geolocation.find_by(ip: ip_address)

SELECT `geolocations`.* FROM `geolocations` WHERE `geolocations`.`ip` = '135.201.250.155' LIMIT 1
DELETE FROM `geolocations` WHERE `geolocations`.`id` = 2
SELECT `geolocations`.* FROM `geolocations` WHERE `geolocations`.`ip` = '1.21.2.2' LIMIT 1
---
  def destroy
    ip_address = params["ip_address"]
    if !IPAddress.valid?(ip_address)
      render422_json(
        json_ext: {
          error_message: "The ip address is invalid."
        }
      )
      return
    end

    @geolocation = Geolocation.find_by(ip: ip_address)

    if @geolocation.blank?
      render422_json(
        json_ext: {
          error_message: "The geolocation does not exist."
        }
      )
      return
    end

    if @geolocation.destroy
      render :show
    else
      render422_json(
        json_ext: {
          error_message: @geolocation.errors.full_messages.join("; ")
        }
      )